AccumulationRegisters/ОстаткиАктивов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиАктивов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВложений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Актив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Активы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

CommonModules/ЗаполнитьПоАктиву/Ext/Module.bsl
// Заполняет реквизиты документа данными выбранного актива.
//
// Параметры:
//   ДокОбъект - ДокументСсылка - документ, для которого выполняется заполнение
Процедура ЗаполнитьПоАктиву(ДокОбъект) Экспорт
	 Если ЗначениеЗаполнено(ДокОбъект.Актив) Тогда
	// Передаем и актив, и пользователя (если он уже выбран), чтобы найти точный остаток
	Данные = ПолучитьДанныеАктиваНаСервере(ДокОбъект.Актив, ДокОбъект.Пользователь);
	
	Если Данные <> Неопределено Тогда
		// 1. Сначала заполняем ссылочные поля
		ДокОбъект.Валюта       = Данные.Валюта;
		ДокОбъект.Пользователь = Данные.Пользователь;
		
		// 2. Затем заполняем числовое поле
		ДокОбъект.ТекущаяСтоимость = Данные.ЦенаИзРегистра;
	КонецЕсли;
	    КонецЕсли;
КонецПроцедуры

// Возвращает данные актива на текущий момент с учетом остатков в регистре
//
// Параметры:
//   СсылкаНаАктив - СправочникСсылка.Активы - ссылка на актив
//   ТекущийПользователь - СправочникСсылка.Пользователи - пользователь для фильтрации остатков, если не задан — берется из актива
//
// Возвращаемое значение:
//   Структура:
//     * Валюта - СправочникСсылка.Валюты - валюта актива
//     * Пользователь - СправочникСсылка.Пользователи - пользователь актива
//     * ЦенаИзРегистра - Число - текущая стоимость остатка из регистра
//   Неопределено - если ссылка на актив пустая
Функция ПолучитьДанныеАктиваНаСервере(СсылкаНаАктив, ТекущийПользователь)
    
    Если СсылкаНаАктив.Пустая() Тогда
        Возврат Неопределено;
    КонецЕсли;
    
    Результат = Новый Структура;
    Результат.Вставить("Валюта",       СсылкаНаАктив.Валюта);
    Результат.Вставить("Пользователь", СсылкаНаАктив.Пользователь);
    
    // Определяем пользователя для фильтра
    НужныйПользователь = ?(ЗначениеЗаполнено(ТекущийПользователь), ТекущийПользователь, СсылкаНаАктив.Пользователь);
    
    Запрос = Новый Запрос;
    // Оборачиваем СУММА в ЕСТЬNULL, чтобы всегда получать число
    Запрос.Текст = 
    "ВЫБРАТЬ


    |	ЕСТЬNULL(СУММА(Остатки.ТекущаяСтоимостьОстаток), 0) КАК Цена
    |ИЗ
    |	РегистрНакопления.ОстаткиАктивов.Остатки(&Период, Актив = &Актив И Пользователь = &Пользователь) КАК Остатки";
    
    // Используем ТекущаяДата или МоментВремени, чтобы видеть остатки на сейчас
    Запрос.УстановитьПараметр("Период",      ТекущаяДата());
    Запрос.УстановитьПараметр("Актив",       СсылкаНаАктив);
    Запрос.УстановитьПараметр("Пользователь", НужныйПользователь);
    
    Выборка = Запрос.Выполнить().Выбрать();
    
    Цена = 0;
    Если Выборка.Следующий() Тогда
        Цена = Выборка.Цена; // Теперь здесь гарантированно число (0 или больше)
    КонецЕсли;
    
    Результат.Вставить("ЦенаИзРегистра", Цена);
    
    Возврат Результат;
    
КонецФункции
